In [15]:
import pandas as pd
df1=pd.read_csv('Parking.csv', index_col=0)

In [16]:
df1.head()

  Registration_State    Issue_Date Vehicle_Make
0                 NY  6/30/16 2:17        TOYOT
1                 NY   7/4/16 1:18        ME/BE
2                 NY  7/11/16 6:15        LINCO
3                 NY   7/4/16 1:10        NISSA
4                 NY   7/1/16 6:30        VOLKS

In [17]:
df1.dtypes

Registration_State    object
Issue_Date            object
Vehicle_Make          object
dtype: object

In [18]:
df1['Issue_Date']=pd.to_datetime(df1['Issue_Date'])
df1.head()

  Registration_State          Issue_Date Vehicle_Make
0                 NY 2016-06-30 02:17:00        TOYOT
1                 NY 2016-07-04 01:18:00        ME/BE
2                 NY 2016-07-11 06:15:00        LINCO
3                 NY 2016-07-04 01:10:00        NISSA
4                 NY 2016-07-01 06:30:00        VOLKS

In [23]:
fd=df1.loc[0,'Issue_Date']
fd

Timestamp('2016-06-30 02:17:00')

In [25]:
fd.hour

2

In [37]:
df1['DOW']=df1['Issue_Date'].dt.day_name()
df1['Month']=df1['Issue_Date'].dt.month
df1.head()

  Registration_State          Issue_Date Vehicle_Make       DOW  Month
0                 NY 2016-06-30 02:17:00        TOYOT  Thursday      6
1                 NY 2016-07-04 01:18:00        ME/BE    Monday      7
2                 NY 2016-07-11 06:15:00        LINCO    Monday      7
3                 NY 2016-07-04 01:10:00        NISSA    Monday      7
4                 NY 2016-07-01 06:30:00        VOLKS    Friday      7